// 0	Вывести квадрат числа
System.Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int kvadrat;
kvadrat = number * number;
System.Console.WriteLine("Вы ввели: " + number);
System.Console.WriteLine("Квадратное значение этого числа: " + kvadrat);